# Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 
# Найдите произведение элементов на указанных позициях. 
# Позиции хранятся в файле file.txt в одной строке одно число.

print('Введите число')
pos = []
n = int(input())
mult = 1
for i in range (-n,n + 1):
    pos.append(i)
    
for i in range (-n,n):
    mult = mult * int(pos[i]) # интересно почему исключена цифра 0
print(f'Список из N элементов, из промежутка [{-n}, {n}] {pos}')
print(f'Произведение элементов на указанных позициях {mult}')