# Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.

print('Введите число')
n = int(input())
num = 0
print(f'Последовательность (1+1/n)^n из {n} элементов')
for i in range(1, n+1):
    num = num + ((1+1)/i) **i
    print(num, end=' ')
print()
