# Напишите программу, которая принимает на вход число N и 
# выдает набор произведений чисел от 1 до N

print('Введите число')

n = int(input())
mult = 1
print(f'Набор произведений чисел от 1 до {n}')
for i in range(1,n+1):
    mult *= i
    print(mult, end=' ')
print()
